*** programs/stockpump/src/math.rs:100:17: replace / with * in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace / with * in payout_for_redeem
@@ -92,17 +92,17 @@
     let keep = BPS_DENOM - fee_bps as u128;
     held.iter()
         .map(|h| {
             let v = (*h as u128)
                 .checked_mul(shares as u128)
                 .ok_or(StockPumpError::MathOverflow)?
                 .checked_mul(keep)
                 .ok_or(StockPumpError::MathOverflow)?
-                / (supply as u128 * BPS_DENOM);
+                * /* ~ changed by cargo-mutants ~ */ (supply as u128 * BPS_DENOM);
             u64::try_from(v).map_err(|_| StockPumpError::MathOverflow)
         })
         .collect()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- math::tests::redeem_never_pays_more_than_pro_rata stdout ----

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: MathOverflow

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: MathOverflow

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: MathOverflow

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: MathOverflow

---- math::tests::redeem_never_lowers_held_per_share stdout ----

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:95:21:
attempt to multiply with overflow

failures:
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::redeem_never_lowers_held_per_share
    math::tests::redeem_never_pays_more_than_pro_rata

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
