*** programs/stockpump/src/math.rs:51:5: replace shares_for_deposit -> Result<u64, StockPumpError> with Ok(0)

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace shares_for_deposit -> Result<u64, StockPumpError> with Ok(0)
@@ -43,39 +43,17 @@
 /// Shares for a proportional in-kind deposit: `min_i(supply * net_in_i / held_i)`.
 /// The minimum is what makes an off-ratio deposit safe — the short leg binds, and the
 /// excess on every other leg stays in the vault (Uniswap V2 behaviour).
 pub fn shares_for_deposit(
     supply: u64,
     held: &[u64],
     net_in: &[u64],
 ) -> Result<u64, StockPumpError> {
-    if held.len() != net_in.len() || held.is_empty() {
-        return Err(StockPumpError::SleeveMismatch);
-    }
-    let mut best: Option<u64> = None;
-    for (h, n) in held.iter().zip(net_in.iter()) {
-        if *h == 0 {
-            return Err(StockPumpError::EmptySleeve);
-        }
-        let m = (supply as u128)
-            .checked_mul(*n as u128)
-            .ok_or(StockPumpError::MathOverflow)?
-            / (*h as u128);
-        let m = u64::try_from(m).map_err(|_| StockPumpError::MathOverflow)?;
-        best = Some(match best {
-            None => m,
-            Some(b) => b.min(m),
-        });
-    }
-    let m = best.ok_or(StockPumpError::SleeveMismatch)?;
-    if m == 0 {
-        return Err(StockPumpError::DepositTooSmall);
-    }
-    Ok(m)
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pro-rata payout less the fee, floored on every leg.
 pub fn payout_for_redeem(
     supply: u64,
     held: &[u64],
     shares: u64,
     fee_bps: u16,

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:214:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:214:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:214:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:214:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

failures:
    math::tests::deposit_then_redeem_is_never_profitable

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
