*** programs/stockpump/src/math.rs:56:15: replace == with != in shares_for_deposit

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace == with != in shares_for_deposit
@@ -48,17 +48,17 @@
     held: &[u64],
     net_in: &[u64],
 ) -> Result<u64, StockPumpError> {
     if held.len() != net_in.len() || held.is_empty() {
         return Err(StockPumpError::SleeveMismatch);
     }
     let mut best: Option<u64> = None;
     for (h, n) in held.iter().zip(net_in.iter()) {
-        if *h == 0 {
+        if *h != /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(StockPumpError::EmptySleeve);
         }
         let m = (supply as u128)
             .checked_mul(*n as u128)
             .ok_or(StockPumpError::MathOverflow)?
             / (*h as u128);
         let m = u64::try_from(m).map_err(|_| StockPumpError::MathOverflow)?;
         best = Some(match best {

*** result: Success
