*** programs/stockpump/src/math.rs:62:13: replace / with % in shares_for_deposit

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace / with % in shares_for_deposit
@@ -54,17 +54,17 @@
     let mut best: Option<u64> = None;
     for (h, n) in held.iter().zip(net_in.iter()) {
         if *h == 0 {
             return Err(StockPumpError::EmptySleeve);
         }
         let m = (supply as u128)
             .checked_mul(*n as u128)
             .ok_or(StockPumpError::MathOverflow)?
-            / (*h as u128);
+            % /* ~ changed by cargo-mutants ~ */ (*h as u128);
         let m = u64::try_from(m).map_err(|_| StockPumpError::MathOverflow)?;
         best = Some(match best {
             None => m,
             Some(b) => b.min(m),
         });
     }
     let m = best.ok_or(StockPumpError::SleeveMismatch)?;
     if m == 0 {

---- math::tests::deposit_never_lowers_held_per_share stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-stockpump-ZbncvV.tmp/programs/stockpump/proptest-regressions/math.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 657e9e9151e1016875baa64437b926ba78ab77d463feee09203bf09140aabf99

thread 'math::tests::deposit_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:148:5:
Test failed: sleeve 0 fell at programs/stockpump/src/math.rs:172.
minimal failing input: supply = 1000, h0 = 947075, h1 = 1236055, amt0 = 32816516, skew = 50, fee_bps = 19
	successes: 1
	local rejects: 0
	global rejects: 0

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-stockpump-ZbncvV.tmp/programs/stockpump/proptest-regressions/math.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc d9f555e3c123cd741596592192e5336b5a1ecf179d05e6a215b048f678eec227

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:148:5:
Test failed: round trip returned 57183224 for 1000 in at programs/stockpump/src/math.rs:237.
minimal failing input: supply = 1000, h0 = 57245190, amt0 = 1000, fee_bps = 1
	successes: 2
	local rejects: 0
	global rejects: 0

failures:
    math::tests::deposit_never_lowers_held_per_share
    math::tests::deposit_then_redeem_is_never_profitable

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
