*** programs/stockpump/src/math.rs:83:30: replace > with < in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace > with < in payout_for_redeem
@@ -75,17 +75,17 @@
 
 /// Pro-rata payout less the fee, floored on every leg.
 pub fn payout_for_redeem(
     supply: u64,
     held: &[u64],
     shares: u64,
     fee_bps: u16,
 ) -> Result<Vec<u64>, StockPumpError> {
-    if shares == 0 || shares > supply {
+    if shares == 0 || shares < /* ~ changed by cargo-mutants ~ */ supply {
         return Err(StockPumpError::BadShareAmount);
     }
     if fee_bps == 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }

---- math::tests::zero_fee_is_refused_everywhere stdout ----

thread 'math::tests::zero_fee_is_refused_everywhere' panicked at programs/stockpump/src/math.rs:120:9:
assertion failed: matches!(payout_for_redeem(1_000, &[1_000], 100, 0),
    Err(StockPumpError::ZeroFee))

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:236:69:
called `Result::unwrap()` on an `Err` value: BadShareAmount

---- math::tests::redeem_never_pays_more_than_pro_rata stdout ----

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:205:73:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:205:73:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:205:73:
called `Result::unwrap()` on an `Err` value: BadShareAmount

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:205:73:
called `Result::unwrap()` on an `Err` value: BadShareAmount

failures:
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::redeem_never_lowers_held_per_share
    math::tests::redeem_never_pays_more_than_pro_rata
    math::tests::zero_fee_is_refused_everywhere

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
