*** programs/stockpump/src/math.rs:92:26: replace - with + in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace - with + in payout_for_redeem
@@ -84,17 +84,17 @@
         return Err(StockPumpError::BadShareAmount);
     }
     if fee_bps == 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }
-    let keep = BPS_DENOM - fee_bps as u128;
+    let keep = BPS_DENOM + /* ~ changed by cargo-mutants ~ */ fee_bps as u128;
     held.iter()
         .map(|h| {
             let v = (*h as u128)
                 .checked_mul(shares as u128)
                 .ok_or(StockPumpError::MathOverflow)?
                 .checked_mul(keep)
                 .ok_or(StockPumpError::MathOverflow)?
                 / (supply as u128 * BPS_DENOM);

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:148:5:
Test failed: round trip returned 1000 for 1000 in at programs/stockpump/src/math.rs:237.
minimal failing input: supply = 1000, h0 = 1000, amt0 = 1000, fee_bps = 6
	successes: 0
	local rejects: 0
	global rejects: 0

---- math::tests::redeem_never_pays_more_than_pro_rata stdout ----

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:148:5:
Test failed: paid 10 > pro-rata 9 at programs/stockpump/src/math.rs:207.
minimal failing input: supply = 2, h0 = 19, frac = 1, fee_bps = 527
	successes: 0
	local rejects: 0
	global rejects: 0

---- math::tests::redeem_never_lowers_held_per_share stdout ----

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:148:5:
Test failed: sleeve 1 fell on redeem at programs/stockpump/src/math.rs:192.
minimal failing input: supply = 2, h0 = 1, h1 = 161, frac = 1, fee_bps = 63
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::redeem_never_lowers_held_per_share
    math::tests::redeem_never_pays_more_than_pro_rata

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
