*** programs/stockpump/src/math.rs:92:26: replace - with / in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace - with / in payout_for_redeem
@@ -84,17 +84,17 @@
         return Err(StockPumpError::BadShareAmount);
     }
     if fee_bps == 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }
-    let keep = BPS_DENOM - fee_bps as u128;
+    let keep = BPS_DENOM / /* ~ changed by cargo-mutants ~ */ fee_bps as u128;
     held.iter()
         .map(|h| {
             let v = (*h as u128)
                 .checked_mul(shares as u128)
                 .ok_or(StockPumpError::MathOverflow)?
                 .checked_mul(keep)
                 .ok_or(StockPumpError::MathOverflow)?
                 / (supply as u128 * BPS_DENOM);

*** result: Success
