*** programs/stockpump/src/math.rs:100:35: replace * with + in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace * with + in payout_for_redeem
@@ -92,17 +92,17 @@
     let keep = BPS_DENOM - fee_bps as u128;
     held.iter()
         .map(|h| {
             let v = (*h as u128)
                 .checked_mul(shares as u128)
                 .ok_or(StockPumpError::MathOverflow)?
                 .checked_mul(keep)
                 .ok_or(StockPumpError::MathOverflow)?
-                / (supply as u128 * BPS_DENOM);
+                / (supply as u128 + /* ~ changed by cargo-mutants ~ */ BPS_DENOM);
             u64::try_from(v).map_err(|_| StockPumpError::MathOverflow)
         })
         .collect()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:191:5:
Test failed: round trip returned 1664972 for 1000 in at programs/stockpump/src/math.rs:294.
minimal failing input: supply = 1000, h0 = 1000, amt0 = 1000, fee_bps = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- math::tests::redeem_never_pays_more_than_pro_rata stdout ----

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:191:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `0`: payout is not floor(pro-rata * keep) at programs/stockpump/src/math.rs:264.
minimal failing input: supply = 2, h0 = 2, frac = 1, fee_bps = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- math::tests::redeem_never_lowers_held_per_share stdout ----

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:241:31:
attempt to subtract with overflow

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:241:31:
attempt to subtract with overflow

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:241:31:
attempt to subtract with overflow

thread 'math::tests::redeem_never_lowers_held_per_share' panicked at programs/stockpump/src/math.rs:241:31:
attempt to subtract with overflow

failures:
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::redeem_never_lowers_held_per_share
    math::tests::redeem_never_pays_more_than_pro_rata

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
