*** programs/stockpump/src/math.rs:27:16: replace == with != in apply_fee

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace == with != in apply_fee
@@ -19,17 +19,17 @@
 //! loop extract the rounding error.
 
 use crate::errors::StockPumpError;
 
 pub const BPS_DENOM: u128 = 10_000;
 
 /// Split `amount` into `(net, fee)`. Fee rounds UP so the skim is never less than fee_bps.
 pub fn apply_fee(amount: u64, fee_bps: u16) -> Result<(u64, u64), StockPumpError> {
-    if fee_bps == 0 {
+    if fee_bps != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }
     let a = amount as u128;
     // div_ceil: the vault keeps the rounding, never the user.
     let fee = (a * fee_bps as u128).div_ceil(BPS_DENOM);

---- math::tests::fee_at_or_above_100_percent_is_refused stdout ----

thread 'math::tests::fee_at_or_above_100_percent_is_refused' panicked at programs/stockpump/src/math.rs:125:9:
assertion failed: matches!(apply_fee(1_000, 10_000), Err(StockPumpError::FeeTooLarge))

---- math::tests::zero_fee_is_refused_everywhere stdout ----

thread 'math::tests::zero_fee_is_refused_everywhere' panicked at programs/stockpump/src/math.rs:119:9:
assertion failed: matches!(apply_fee(1_000, 0), Err(StockPumpError::ZeroFee))

---- math::tests::fee_split_is_exact_and_rounds_to_the_vault stdout ----

thread 'math::tests::fee_split_is_exact_and_rounds_to_the_vault' panicked at programs/stockpump/src/math.rs:273:57:
called `Result::unwrap()` on an `Err` value: ZeroFee

thread 'math::tests::fee_split_is_exact_and_rounds_to_the_vault' panicked at programs/stockpump/src/math.rs:273:57:
called `Result::unwrap()` on an `Err` value: ZeroFee

thread 'math::tests::fee_split_is_exact_and_rounds_to_the_vault' panicked at programs/stockpump/src/math.rs:273:57:
called `Result::unwrap()` on an `Err` value: ZeroFee

thread 'math::tests::fee_split_is_exact_and_rounds_to_the_vault' panicked at programs/stockpump/src/math.rs:273:57:
called `Result::unwrap()` on an `Err` value: ZeroFee

failures:
    math::tests::deposit_never_lowers_held_per_share
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::fee_at_or_above_100_percent_is_refused
    math::tests::fee_split_is_exact_and_rounds_to_the_vault
    math::tests::zero_fee_is_refused_everywhere

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
