*** programs/stockpump/src/math.rs:35:18: replace * with / in apply_fee

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace * with / in apply_fee
@@ -27,17 +27,17 @@
     if fee_bps == 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }
     let a = amount as u128;
     // div_ceil: the vault keeps the rounding, never the user.
-    let fee = (a * fee_bps as u128).div_ceil(BPS_DENOM);
+    let fee = (a / /* ~ changed by cargo-mutants ~ */ fee_bps as u128).div_ceil(BPS_DENOM);
     let net = a.checked_sub(fee).ok_or(StockPumpError::MathOverflow)?;
     Ok((
         u64::try_from(net).map_err(|_| StockPumpError::MathOverflow)?,
         u64::try_from(fee).map_err(|_| StockPumpError::MathOverflow)?,
     ))
 }
 
 /// Shares for a proportional in-kind deposit: `min_i(supply * net_in_i / held_i)`.

---- math::tests::fee_split_is_exact_and_rounds_to_the_vault stdout ----

thread 'math::tests::fee_split_is_exact_and_rounds_to_the_vault' panicked at programs/stockpump/src/math.rs:191:5:
Test failed: fee rounded toward the user at programs/stockpump/src/math.rs:276.
minimal failing input: amount = 1, fee_bps = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    math::tests::fee_split_is_exact_and_rounds_to_the_vault

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
