*** programs/stockpump/src/math.rs:51:19: replace != with == in shares_for_deposit

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace != with == in shares_for_deposit
@@ -43,17 +43,17 @@
 /// Shares for a proportional in-kind deposit: `min_i(supply * net_in_i / held_i)`.
 /// The minimum is what makes an off-ratio deposit safe — the short leg binds, and the
 /// excess on every other leg stays in the vault (Uniswap V2 behaviour).
 pub fn shares_for_deposit(
     supply: u64,
     held: &[u64],
     net_in: &[u64],
 ) -> Result<u64, StockPumpError> {
-    if held.len() != net_in.len() || held.is_empty() {
+    if held.len() == /* ~ changed by cargo-mutants ~ */ net_in.len() || held.is_empty() {
         return Err(StockPumpError::SleeveMismatch);
     }
     let mut best: Option<u64> = None;
     for (h, n) in held.iter().zip(net_in.iter()) {
         if *h == 0 {
             return Err(StockPumpError::EmptySleeve);
         }
         let m = (supply as u128)

---- math::tests::deposit_mints_the_minimum_across_sleeves_not_the_maximum stdout ----

thread 'math::tests::deposit_mints_the_minimum_across_sleeves_not_the_maximum' panicked at programs/stockpump/src/math.rs:179:75:
called `Result::unwrap()` on an `Err` value: SleeveMismatch

---- math::tests::deposit_rejects_a_zero_sleeve stdout ----

thread 'math::tests::deposit_rejects_a_zero_sleeve' panicked at programs/stockpump/src/math.rs:154:9:
assertion failed: matches!(shares_for_deposit(1_000, &[0, 500], &[10, 10]),
    Err(StockPumpError::EmptySleeve))

---- math::tests::deposit_rejects_mismatched_or_empty_sleeves stdout ----

thread 'math::tests::deposit_rejects_mismatched_or_empty_sleeves' panicked at programs/stockpump/src/math.rs:160:9:
assertion failed: matches!(shares_for_deposit(1_000, &[500, 500], &[10]),
    Err(StockPumpError::SleeveMismatch))

failures:
    math::tests::deposit_mints_the_minimum_across_sleeves_not_the_maximum
    math::tests::deposit_never_lowers_held_per_share
    math::tests::deposit_rejects_a_zero_sleeve
    math::tests::deposit_rejects_mismatched_or_empty_sleeves
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::deposit_too_small_is_refused_rather_than_minting_zero

test result: FAILED. 8 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
