*** programs/stockpump/src/math.rs:51:35: replace || with && in shares_for_deposit

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace || with && in shares_for_deposit
@@ -43,17 +43,17 @@
 /// Shares for a proportional in-kind deposit: `min_i(supply * net_in_i / held_i)`.
 /// The minimum is what makes an off-ratio deposit safe — the short leg binds, and the
 /// excess on every other leg stays in the vault (Uniswap V2 behaviour).
 pub fn shares_for_deposit(
     supply: u64,
     held: &[u64],
     net_in: &[u64],
 ) -> Result<u64, StockPumpError> {
-    if held.len() != net_in.len() || held.is_empty() {
+    if held.len() != net_in.len() && /* ~ changed by cargo-mutants ~ */ held.is_empty() {
         return Err(StockPumpError::SleeveMismatch);
     }
     let mut best: Option<u64> = None;
     for (h, n) in held.iter().zip(net_in.iter()) {
         if *h == 0 {
             return Err(StockPumpError::EmptySleeve);
         }
         let m = (supply as u128)

---- math::tests::deposit_rejects_mismatched_or_empty_sleeves stdout ----

thread 'math::tests::deposit_rejects_mismatched_or_empty_sleeves' panicked at programs/stockpump/src/math.rs:160:9:
assertion failed: matches!(shares_for_deposit(1_000, &[500, 500], &[10]),
    Err(StockPumpError::SleeveMismatch))

failures:
    math::tests::deposit_rejects_mismatched_or_empty_sleeves

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
