*** programs/stockpump/src/math.rs:83:20: replace || with && in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace || with && in payout_for_redeem
@@ -75,17 +75,17 @@
 
 /// Pro-rata payout less the fee, floored on every leg.
 pub fn payout_for_redeem(
     supply: u64,
     held: &[u64],
     shares: u64,
     fee_bps: u16,
 ) -> Result<Vec<u64>, StockPumpError> {
-    if shares == 0 || shares > supply {
+    if shares == 0 && /* ~ changed by cargo-mutants ~ */ shares > supply {
         return Err(StockPumpError::BadShareAmount);
     }
     if fee_bps == 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }

---- math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary stdout ----

thread 'math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary' panicked at programs/stockpump/src/math.rs:184:9:
assertion failed: matches!(payout_for_redeem(1_000, &[1_000], 0, 100),
    Err(StockPumpError::BadShareAmount))

failures:
    math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
