*** programs/stockpump/src/math.rs:83:5: replace payout_for_redeem -> Result<Vec<u64>, StockPumpError> with Ok(vec![1])

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace payout_for_redeem -> Result<Vec<u64>, StockPumpError> with Ok(vec![1])
@@ -75,37 +75,17 @@
 
 /// Pro-rata payout less the fee, floored on every leg.
 pub fn payout_for_redeem(
     supply: u64,
     held: &[u64],
     shares: u64,
     fee_bps: u16,
 ) -> Result<Vec<u64>, StockPumpError> {
-    if shares == 0 || shares > supply {
-        return Err(StockPumpError::BadShareAmount);
-    }
-    if fee_bps == 0 {
-        return Err(StockPumpError::ZeroFee);
-    }
-    if fee_bps as u128 >= BPS_DENOM {
-        return Err(StockPumpError::FeeTooLarge);
-    }
-    let keep = BPS_DENOM - fee_bps as u128;
-    held.iter()
-        .map(|h| {
-            let v = (*h as u128)
-                .checked_mul(shares as u128)
-                .ok_or(StockPumpError::MathOverflow)?
-                .checked_mul(keep)
-                .ok_or(StockPumpError::MathOverflow)?
-                / (supply as u128 * BPS_DENOM);
-            u64::try_from(v).map_err(|_| StockPumpError::MathOverflow)
-        })
-        .collect()
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use proptest::prelude::*;
 
     /// held_i/supply compared without floats: a/b >= c/d  <=>  a*d >= c*b, in u128.

---- math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary stdout ----

thread 'math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary' panicked at programs/stockpump/src/math.rs:164:9:
assertion failed: matches!(payout_for_redeem(1_000, &[1_000], 0, 100),
    Err(StockPumpError::BadShareAmount))

---- math::tests::zero_fee_is_refused_everywhere stdout ----

thread 'math::tests::zero_fee_is_refused_everywhere' panicked at programs/stockpump/src/math.rs:100:9:
assertion failed: matches!(payout_for_redeem(1_000, &[1_000], 100, 0),
    Err(StockPumpError::ZeroFee))

---- math::tests::redeem_never_pays_more_than_pro_rata stdout ----

thread 'math::tests::redeem_never_pays_more_than_pro_rata' panicked at programs/stockpump/src/math.rs:171:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `2`: payout is not floor(pro-rata * keep) at programs/stockpump/src/math.rs:244.
minimal failing input: supply = 2, h0 = 5, frac = 1, fee_bps = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    math::tests::redeem_never_lowers_held_per_share
    math::tests::redeem_never_pays_more_than_pro_rata
    math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary
    math::tests::zero_fee_is_refused_everywhere

test result: FAILED. 10 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
