*** programs/stockpump/src/math.rs:86:16: replace == with != in payout_for_redeem

*** mutation diff:
--- programs/stockpump/src/math.rs
+++ replace == with != in payout_for_redeem
@@ -78,17 +78,17 @@
     supply: u64,
     held: &[u64],
     shares: u64,
     fee_bps: u16,
 ) -> Result<Vec<u64>, StockPumpError> {
     if shares == 0 || shares > supply {
         return Err(StockPumpError::BadShareAmount);
     }
-    if fee_bps == 0 {
+    if fee_bps != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(StockPumpError::ZeroFee);
     }
     if fee_bps as u128 >= BPS_DENOM {
         return Err(StockPumpError::FeeTooLarge);
     }
     let keep = BPS_DENOM - fee_bps as u128;
     held.iter()
         .map(|h| {

---- math::tests::zero_fee_is_refused_everywhere stdout ----

thread 'math::tests::zero_fee_is_refused_everywhere' panicked at programs/stockpump/src/math.rs:120:9:
assertion failed: matches!(payout_for_redeem(1_000, &[1_000], 100, 0),
    Err(StockPumpError::ZeroFee))

---- math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary stdout ----

thread 'math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary' panicked at programs/stockpump/src/math.rs:188:9:
assertion failed: payout_for_redeem(1_000, &[1_000], 1_000, 100).is_ok()

---- math::tests::deposit_then_redeem_is_never_profitable stdout ----

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:293:65:
called `Result::unwrap()` on an `Err` value: ZeroFee

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:293:65:
called `Result::unwrap()` on an `Err` value: ZeroFee

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:293:65:
called `Result::unwrap()` on an `Err` value: ZeroFee

thread 'math::tests::deposit_then_redeem_is_never_profitable' panicked at programs/stockpump/src/math.rs:293:65:
called `Result::unwrap()` on an `Err` value: ZeroFee

failures:
    math::tests::deposit_then_redeem_is_never_profitable
    math::tests::redeem_never_lowers_held_per_share
    math::tests::redeem_never_pays_more_than_pro_rata
    math::tests::redeem_rejects_zero_and_over_supply_at_the_boundary
    math::tests::zero_fee_is_refused_everywhere

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
